---
kind: type
id: T:Autodesk.Revit.DB.SaveModifiedLinksOptions
source: html/0d60b26d-4684-453f-4b90-e252334dac5e.htm
---
# Autodesk.Revit.DB.SaveModifiedLinksOptions

Class giving options when saving linked files which have been modified
 in-memory by shared coordinates operations.

## Syntax (C#)
```csharp
public enum SaveModifiedLinksOptions
```